templates/case_template_highRe/backGround/system/FOvorticity
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

vorticity1
{
    // Mandatory entries
    type            vorticity;
    libs            ("libfieldFunctionObjects.so");

    // Optional (inherited) entries
    field           U;
    result          vorticityField;
    region          region0;
    enabled         true;
    log             true;
    timeStart       0;
    timeEnd         1000;
    executeControl  timeStep;
    executeInterval 2;
    writeControl    writeTime;
    //writeInterval   25;
}


// ************************************************************************* //
